primat2/lab2/docs/lab2.tex
% Created 2023-03-12 Sun 18:18
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[T2A]{fontenc}
\usepackage{parskip}
\usepackage[margin=0.5in]{geometry}
\usepackage{enumerate}
\usepackage{nopageno}
\author{megabluejay}
\date{}
\title{}
\hypersetup{
 pdfauthor={megabluejay},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}


\section*{Вариант 1}
\label{sec:orgc0348c7}

Две конкурирующие крупные торговые фирмы \(F_1\) и \(F_2\), планируют построить в одном из четырех небольших городов \(G_1\), \(G_2\), \(G_3\), \(G_4\), лежащих вдоль автомагистрали, по одному универсаму.

\begin{table}[htbp]
\label{data1}
\centering
\begin{tabular}{lrrrr}
 & \(G_1\) & \(G_2\) & \(G_3\) & \(G_4\)\\[0pt]
\hline
км & 0 & 30 & 40 & 150\\[0pt]
тыс & 30 & 50 & 40 & 30\\[0pt]
\end{tabular}
\end{table}


Доход определяется численностью населения городов и степенью удаленности.

Пусть \(d_j^i\) - расстояния от магазина \(j\) фирмы до \(i\) города

При \(d_1^i < d_2^i\) \(F_1\) получает 75\%
При \(d_1^i = d_2^i\) 60\%
При \(d_1^i > d_2^i\) 45\%

Матрица игры:

\begin{minted}[]{python}
ds, pops = data

def f(i, j, k):
    di, dj = abs(ds[i] - ds[k]), abs(ds[j] - ds[k])
    if di < dj:
        return 0.75
    elif di == dj:
        return 0.6
    else:
        return 0.45

[[sum(pops[k] * f(i, j, k) for k in range(4)) for j in range(4)] for i in range(4)]
\end{minted}

\(\begin{pmatrix}
 90.0 & 76.5 & 76.5 & 103.5 \\[0pt]
 103.5 & 90.0 & 91.5 & 103.5 \\[0pt]
 103.5 & 88.5 & 90.0 & 103.5 \\[0pt]
 76.5 & 76.5 & 76.5 & 90.0 \\[0pt]
\end{pmatrix}
\)

У нее есть седловая точка:

\begin{minted}[]{python}
max(map(min, matrix)), min(max(matrix[i][j] for i in range(4)) for j in range(4))
\end{minted}

\begin{center}
\begin{tabular}{rr}
90.0 & 90.0\\[0pt]
\end{tabular}
\end{center}

Оптимально обеим фирмам строить в \(G_2\)

\section*{Вариант 7}
\label{sec:orgf878484}

Платежная матрица:

\(\begin{pmatrix}
 1 & -1 & -1 \\[0pt]
 -1 & -1 & 3 \\[0pt]
 -1 & 2 & -1 \\[0pt]
\end{pmatrix}
\)

Стратегии:

\(\begin{pmatrix}
 6 / 13 & 3 / 13 & 4 / 13 \\[0pt]
 6 / 13 & 4 / 13 & 3 / 13 \\[0pt]
\end{pmatrix}
\)

\begin{minted}[]{python}
strat1, strat2 = strat
round(sum(strat1[i] * sum(matrix[i][j] * strat2[j] for j in range(3)) for i in range(3)), 3)
\end{minted}

\begin{verbatim}
-0.077
\end{verbatim}

\section*{Вариант 8}
\label{sec:org44faf9c}

\(x_1 + x_2 \rightarrow \min\)

\begin{cases}
7 x_1 + 2 x_2 \geq 1 \\
x_1 + 11 x_2 \geq 1 \\
x_1, x_2 \geq 0
\end{cases}

Пусть

\begin{cases}
x_1 = \frac{x}{v} \\
x_2 = \frac{1 - x}{v}
\end{cases}

Тогда задачу можно записать как

\(v = \frac{1}{x_1 + x_2} \rightarrow max\)

\begin{cases}
7 x + 2 (1 - x) \geq v \\
x + 11 (1 - x) \geq v \\
1 \geq x \geq 0
\end{cases}

Если рассматривать \(x\), как вероятность выбора 1м игроком 1й стратегии, а каждую строку как случай чистой стратегии 2го игрока,
это соответствует матричной игре

\(\begin{pmatrix}
 7 & 1 \\[0pt]
 2 & 11 \\[0pt]
\end{pmatrix}
\)

\section*{Вариант 9}
\label{sec:org0cdc7b4}

Матрица игры:

\begin{center}
\begin{tabular}{rrrr}
7 & 2 & 5 & 1\\[0pt]
2 & 2 & 3 & 4\\[0pt]
5 & 3 & 4 & 4\\[0pt]
3 & 2 & 1 & 6\\[0pt]
\end{tabular}
\end{center}

1 столбец доминирует над 2

\begin{center}
\begin{tabular}{rrr}
7 & 5 & 1\\[0pt]
2 & 3 & 4\\[0pt]
5 & 4 & 4\\[0pt]
3 & 1 & 6\\[0pt]
\end{tabular}
\end{center}

3 строка доминирует над 2

\begin{center}
\begin{tabular}{rrr}
7 & 5 & 1\\[0pt]
5 & 4 & 4\\[0pt]
3 & 1 & 6\\[0pt]
\end{tabular}
\end{center}

1 столбец доминирует над 2

\begin{center}
\begin{tabular}{rr}
7 & 1\\[0pt]
5 & 4\\[0pt]
3 & 6\\[0pt]
\end{tabular}
\end{center}
\end{document}